# Agregación de datos por categoría

In [1]:
import numpy as np
import pandas as pd

In [2]:
gender = ["Male","Famale"]
income = ["Poor","Middle Class","Rich"]

In [3]:
n = 500
gender_data = []
income_data = []

for i in range(0,500):
    gender_data.append(np.random.choice(gender))
    income_data.append(np.random.choice(income))

In [11]:
gender_data[0:10]

['Famale',
 'Famale',
 'Famale',
 'Male',
 'Male',
 'Famale',
 'Male',
 'Famale',
 'Male',
 'Famale']

In [10]:
income_data[0:10]

['Middle Class',
 'Poor',
 'Rich',
 'Poor',
 'Poor',
 'Poor',
 'Rich',
 'Poor',
 'Poor',
 'Middle Class']

In [27]:
#Z -> N(0,1)
# N(n,s) .> m + s * z
height = 160 + 30 * np.random.randn(n) 
weight = 65 + 35* np.random.randn(n)
age = 30 + 12 * np.random.randn(n)
income = 18000 + 3500 * np.random.randn(n)

In [28]:
data = pd.DataFrame(
    {
        "Gender": gender_data,
        "Economic Status" : income_data,
        "Height" : height,
        "Weight": weight,
        "Age" : age,
        "Income" : income
    }
)

In [29]:
data.head()

   Gender Economic Status      Height     Weight        Age        Income
0  Famale    Middle Class  114.568597  91.967480  36.007970  19053.247760
1  Famale            Poor  129.617922  54.985976  15.165654  17223.010704
2  Famale            Rich  137.015391  52.376387  21.574901  18545.557352
3    Male            Poor  183.464511  80.481074  37.134853  21577.663358
4    Male            Poor  159.995020  67.631659  53.582084  15759.975653

# Agrupación de datos

In [31]:
grouped_gender = data.groupby("Gender")

In [32]:
grouped_gender.groups

{'Famale': Int64Index([  0,   1,   2,   5,   7,   9,  10,  12,  13,  15,
             ...
             479, 481, 489, 492, 493, 494, 495, 496, 497, 499],
            dtype='int64', length=227),
 'Male': Int64Index([  3,   4,   6,   8,  11,  14,  17,  20,  22,  24,
             ...
             482, 483, 484, 485, 486, 487, 488, 490, 491, 498],
            dtype='int64', length=273)}

In [34]:
for names,groups in grouped_gender:
    print(names)
    print(groups)

Famale
     Gender Economic Status      Height      Weight        Age        Income
0    Famale    Middle Class  114.568597   91.967480  36.007970  19053.247760
1    Famale            Poor  129.617922   54.985976  15.165654  17223.010704
2    Famale            Rich  137.015391   52.376387  21.574901  18545.557352
5    Famale            Poor  161.248079   95.753171  22.262381  18913.590590
7    Famale            Poor  146.022835   43.221859  38.401199  10339.187511
..      ...             ...         ...         ...        ...           ...
494  Famale            Poor  175.680802   76.809134  23.134843  18178.648896
495  Famale            Rich  147.399945   27.046794  27.054453  14485.809848
496  Famale    Middle Class  120.900192  109.233151  31.970188  15418.793644
497  Famale            Poor   97.476301   30.587236  40.748617  13359.647723
499  Famale            Rich  194.456051    4.874292  43.596674  11992.148680

[227 rows x 6 columns]
Male
    Gender Economic Status      Height      Weight        Age        Income
3     Male            Poor  183.464511   80.481074  37.134853  21577.663358
4     Male            Poor  159.995020   67.631659  53.582084  15759.975653
6     Male            Rich  155.319953   69.632285  28.084271  16720.708677
8     Male            Poor  182.995144   94.542935  53.044715  19951.628057
11    Male    Middle Class  202.823680   60.662216  45.896819  17819.936018
..     ...             ...         ...         ...        ...           ...
487   Male    Middle Class  174.223390  101.771455  29.628532  20618.763169
488   Male    Middle Class  132.156297   85.032226  30.622080  13162.506430
490   Male            Rich   91.337934   52.310914  20.499339  19069.233489
491   Male            Rich  200.028276   -3.300092  30.834902  21389.612578
498   Male            Poor  132.291407   56.621978  29.123379  22603.279846

[273 rows x 6 columns]

In [35]:
grouped_gender.get_group("Famale")

    Economic Status      Height      Weight        Age        Income
0      Middle Class  114.568597   91.967480  36.007970  19053.247760
1              Poor  129.617922   54.985976  15.165654  17223.010704
2              Rich  137.015391   52.376387  21.574901  18545.557352
5              Poor  161.248079   95.753171  22.262381  18913.590590
7              Poor  146.022835   43.221859  38.401199  10339.187511
..              ...         ...         ...        ...           ...
494            Poor  175.680802   76.809134  23.134843  18178.648896
495            Rich  147.399945   27.046794  27.054453  14485.809848
496    Middle Class  120.900192  109.233151  31.970188  15418.793644
497            Poor   97.476301   30.587236  40.748617  13359.647723
499            Rich  194.456051    4.874292  43.596674  11992.148680

[227 rows x 5 columns]

In [36]:
double_group = data.groupby(["Gender","Economic Status"])

In [37]:
len(double_group)

6

In [38]:
for names,groups in double_group:
    print(names)
    print(groups)

('Famale', 'Middle Class')
     Gender Economic Status      Height      Weight        Age        Income
0    Famale    Middle Class  114.568597   91.967480  36.007970  19053.247760
9    Famale    Middle Class  165.342760   12.843135  33.717056  14121.815568
10   Famale    Middle Class  179.934274  102.834787  32.208549  16305.599280
12   Famale    Middle Class  117.209115   97.015300  42.631712  15710.283168
13   Famale    Middle Class  153.952680   60.646138  23.000480  21995.133562
..      ...             ...         ...         ...        ...           ...
479  Famale    Middle Class  220.074818   62.264773  25.075431  20385.539459
489  Famale    Middle Class  166.316007   57.615830  37.885372  14123.826377
492  Famale    Middle Class  247.509428   27.859273  28.557290  14612.277210
493  Famale    Middle Class  116.128480   70.819414  42.468695  18867.826081
496  Famale    Middle Class  120.900192  109.233151  31.970188  15418.793644

[83 rows x 6 columns]
('Famale', 'Poor')
     Gender Economic Status      Height      Weight        Age        Income
1    Famale            Poor  129.617922   54.985976  15.165654  17223.010704
5    Famale            Poor  161.248079   95.753171  22.262381  18913.590590
7    Famale            Poor  146.022835   43.221859  38.401199  10339.187511
25   Famale            Poor  155.065453  129.063184  47.393673  20892.439568
31   Famale            Poor  165.061311   34.553091  43.122271  19677.743775
..      ...             ...         ...         ...        ...           ...
459  Famale            Poor  169.091435   63.050242  18.481081  19797.771688
468  Famale            Poor  208.926513   78.541129  33.792693  15879.501091
481  Famale            Poor  192.847850   67.588123  35.216724  16461.887437
494  Famale            Poor  175.680802   76.809134  23.134843  18178.648896
497  Famale            Poor   97.476301   30.587236  40.748617  13359.647723

[72 rows x 6 columns]
('Famale', 'Rich')
     Gender Economic Status      Height      Weight        Age        Income
2    Famale            Rich  137.015391   52.376387  21.574901  18545.557352
15   Famale            Rich  195.384511  120.378385  39.769916  19151.484421
16   Famale            Rich  188.109389   85.122669  28.806010  15921.706133
18   Famale            Rich  174.505039   92.490970  31.997062  17875.485407
19   Famale            Rich  137.681137   76.805790  30.691968  19932.677373
..      ...             ...         ...         ...        ...           ...
467  Famale            Rich  108.702864  111.625302   3.843362  19016.820583
471  Famale            Rich  189.577866   51.692503  32.667247  25422.588208
472  Famale            Rich  144.768225   39.056167  19.640114  16200.042096
495  Famale            Rich  147.399945   27.046794  27.054453  14485.809848
499  Famale            Rich  194.456051    4.874292  43.596674  11992.148680

[72 rows x 6 columns]
('Male', 'Middle Class')
    Gender Economic Status      Height      Weight        Age        Income
11    Male    Middle Class  202.823680   60.662216  45.896819  17819.936018
14    Male    Middle Class  204.882236   93.095425  33.475827  22297.544999
17    Male    Middle Class  178.468876   71.626508  54.623910  26682.569761
26    Male    Middle Class  159.785836   40.704988  41.855555  16247.644951
32    Male    Middle Class  164.267922   73.860193   9.713024  17837.035156
..     ...             ...         ...         ...        ...           ...
482   Male    Middle Class  140.088863  121.361159  43.581115  18417.765857
483   Male    Middle Class  183.892722   44.441804  30.981524  15793.107493
486   Male    Middle Class  127.105252   80.865241  42.266437  18728.387953
487   Male    Middle Class  174.223390  101.771455  29.628532  20618.763169
488   Male    Middle Class  132.156297   85.032226  30.622080  13162.506430

[94 rows x 6 columns]
('Male', 'Poor')
    Gender Economic Status      Height     Weight        Age        Income
3     Male            Poor  183.464511  80.481074  37.134853  21577.663358
4     Male            Poor  159.995020  67.631659  53.582084  15759.975653
8     Male            Poor  182.995144  94.542935  53.044715  19951.628057
24    Male            Poor  177.686772  59.833935  26.884189  21759.175288
29    Male            Poor  163.829847  67.529324  41.649980  13666.456019
..     ...             ...         ...        ...        ...           ...
460   Male            Poor  146.284488  49.129317  32.751644  17665.087157
465   Male            Poor  147.124331  68.619728  15.523536  18469.254859
476   Male            Poor  106.355832  32.891978  34.160165  19460.920206
484   Male            Poor  175.985085  65.470002  24.884940  16871.536108
498   Male            Poor  132.291407  56.621978  29.123379  22603.279846

[90 rows x 6 columns]
('Male', 'Rich')
    Gender Economic Status      Height      Weight        Age        Income
6     Male            Rich  155.319953   69.632285  28.084271  16720.708677
20    Male            Rich  135.448083   68.096348  24.915551  15459.498896
22    Male            Rich  181.507414  112.630892  28.986755  24679.904218
30    Male            Rich  168.825848  140.758549  27.485231  24356.093529
34    Male            Rich  198.462666   84.728215  23.511205  13386.771979
..     ...             ...         ...         ...        ...           ...
477   Male            Rich  180.695223   86.594124  13.840748  14346.417290
480   Male            Rich  146.349346  131.139798  45.913265  22718.286910
485   Male            Rich  160.169346   67.253522   9.582681  16623.553068
490   Male            Rich   91.337934   52.310914  20.499339  19069.233489
491   Male            Rich  200.028276   -3.300092  30.834902  21389.612578

[89 rows x 6 columns]